Documents/удалить_ИА_НастройкаФП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>удалить_ИА_НастройкаФП</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникДанных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникКонтрагент</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникСтатья</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникСумма</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникДата</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникНастройкаОтбора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникХранилищеЗапросаКонстурктора</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИА_НастройкаОтбораХранилище</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Доходы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидДохода</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИА_ВидыДоходов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидПолученияДанных</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ИА_ВариантыПолученияДанныхВидыДоходов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстВыраженияЗапросаБезнал</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстВыраженияЗапросаНал</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяРегистраБезнал</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>70</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РесурсРегистраБезнал</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>70</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяРегистраНал</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>70</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РесурсРегистраНал</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>70</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПолеСтатьяДДСБезнал</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПолеСтатьяДДСНал</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПолитикаРаспределения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Фонд</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИА_Фонды</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РежимРасчета</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ИА_РежимРасчетаСуммы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>1000</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИА_ЦФО</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеБезнал</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>1000</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Раздел</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИА_РазделыПолитикиФП</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентОтИтогаРаздела</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИА_РазделыПолитикиФП</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПолитикаРаспределенияПервичная</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Фонд</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИА_Фонды</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РежимРасчета</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ИА_РежимРасчетаСуммы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>1000</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИА_ЦФО</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеБезнал</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>1000</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Раздел</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИА_РазделыПолитикиФП</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентОтИтогаРаздела</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИА_РазделыПолитикиФП</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПараметрыВыраженияЗапроса</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидДохода</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИА_ВидыДоходов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипОплаты</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ИА_ТипДвиженияДенежныхСредств</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидПолученияДанных</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ИА_ВариантыПолученияДанныхВидыДоходов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Параметр</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипСравнения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>25</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>1000</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлючСписка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СпискиЗначенийПараметров</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидДохода</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИА_ВидыДоходов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипОплаты</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ИА_ТипДвиженияДенежныхСредств</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидПолученияДанных</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ИА_ВариантыПолученияДанныхВидыДоходов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Параметр</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>1000</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлючСписка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/удалить_ИА_НастройкаФП/Ext/ObjectModule.bsl
Перем ТаблицаСоответствийВидовСравнений;

Процедура УстановитьНастройкиКомпоновщика(КомпоновщикНастроек) Экспорт
		
	СКД = Документы.удалить_ИА_НастройкаФП.ПолучитьМакет("МакетСКД");
	Если ЗначениеЗаполнено(ИсточникДанных) Тогда
		СКД.НаборыДанных.НаборДанных1.Запрос = "ВЫБРАТЬ * ИЗ " + ИсточникДанных + " КАК Источник323";
	Иначе
		Возврат;
	КонецЕсли;
	
	АдресСКД = ПоместитьВоВременноеХранилище(СКД, Новый УникальныйИдентификатор);
    КомпоновщикНастроек.ЗагрузитьНастройки(СКД.НастройкиПоУмолчанию);
	КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресСКД)); //отвечает за доступность полей выбора
	   	
КонецПроцедуры 

Функция ПолучитьТаблицуОтборов()
	тзОтборы = Новый ТаблицаЗначений;
	тзОтборы.Колонки.Добавить("ИмяПараметра");
	тзОтборы.Колонки.Добавить("ЛевоеЗначение");
	тзОтборы.Колонки.Добавить("ВидСравнения");
	тзОтборы.Колонки.Добавить("ПравоеЗначение");
	
	КомпоновщикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных;
	Настр = ПолучитьНастройкиXML();
	Если Не Настр = НЕопределено Тогда
		КомпоновщикНастроек.ЗагрузитьНастройки(Настр);
		НаборНастроек = КомпоновщикНастроек.Настройки.Отбор.Элементы;
		
		Для каждого с из НаборНастроек Цикл
			Если Не с.Использование Тогда Продолжить КонецЕсли;
			ИмяПараметра = СтрЗаменить(Строка(с.ЛевоеЗначение), ".", "");
			НовыйОтбор = тзОтборы.Добавить();
			НовыйОтбор.ИмяПараметра = ИмяПараметра;
			НовыйОтбор.ЛевоеЗначение = с.ЛевоеЗначение;
			НовыйОтбор.ВидСравнения = с.ВидСравнения;
			НовыйОтбор.ПравоеЗначение = с.ПравоеЗначение;
		КонецЦикла;
	КонецЕсли;
	
	Возврат тзОтборы;
	
КонецФункции // ПолучитьТаблицуОтборов()

Процедура ВосстановитьНастройки(КомпоновщикНастроек) Экспорт
	
	УстановитьНастройкиКомпоновщика(КомпоновщикНастроек);
	//Если Не ПустаяСтрока(СокрЛП(ИсточникНастройкаОтбора)) Тогда
	Если ИА_НастройкаОтбораХранилище.Получить()<>Неопределено Тогда
		КомпоновщикНастроек.ЗагрузитьНастройки(ПолучитьНастройкиXML());
	КонецЕсли; 
	
КонецПроцедуры 

Функция ПолучитьЗапросКонструктора()
	
	Запрос = Новый Запрос;
			                                   
	ШаблонЗапроса1 = "ВЫБРАТЬ Источник323.<Контрагент> КАК Контрагент,
	                    |Источник323.<Период> КАК Период,
						|Источник323.<Статья> КАК Продукт,
						|Источник323.<Сумма> КАК Сумма
						|ИЗ <ИсточникДанных> КАК Источник323
						|ГДЕ 1 = 1 И 2 = 2"; //шаблон запроса для простого случая
						
	ШаблонЗапроса2 = "ВЫБРАТЬ Источник323.<Контрагент> КАК Контрагент,
						|Источник323.<Период> КАК Период,
						|Источник323.<Статья> КАК Продукт,
						|Источник323.<Сумма> КАК Сумма
						|ИЗ <ИсточникДанных>(<&ДатаКонца>, 1 = 1) КАК Источник323
						|ГДЕ 2 = 2"; //шаблон запроса для Остатки, СрезПервых, СрезПоследних
						
	ШаблонЗапроса3 = "ВЫБРАТЬ Источник323.<Контрагент> КАК Контрагент,
						|Источник323.<Период> КАК Период,
						|Источник323.<Статья> КАК Продукт,
						|Источник323.<Сумма> КАК Сумма
						|ИЗ <ИсточникДанных>(<&ДатаНачала>, <&ДатаКонца>, Регистратор, 1 = 1) КАК Источник323
						|ГДЕ 2 = 2"; //шаблон запроса для Обороты
						
	
						
						
	ТекстЗапросаКонструктора = ШаблонЗапроса1;	
	НомерШаблона = 1;
	Если Найти(ИсточникДанных, ".Остатки") <> 0 
		Или Найти(ИсточникДанных, ".СрезПервых") <> 0 
		Или Найти(ИсточникДанных, ".СрезПоследних") <> 0 Тогда
		ТекстЗапросаКонструктора = ШаблонЗапроса2;
		НомерШаблона = 2;
	ИначеЕсли Найти(ИсточникДанных, ".Обороты") <> 0 Тогда
		ТекстЗапросаКонструктора = ШаблонЗапроса3;
		НомерШаблона = 3;
	КонецЕсли;	
	
	//Формируем таблицу условий					
	
	Условие1 = "";  // 1 = 1
	Условие2 = "";	// 2 = 2
	тзНаборПараметров = ПолучитьТаблицуОтборов();
	ЭтоДокумент = Найти(ИсточникДанных, "Документ.") <> 0;
	
	Если ЭтоДокумент Тогда
		ЭтоТабЧасть = СтрЧислоВхождений(ИсточникДанных, ".") = 2;
		ПутьРеквизитаДата = ?(ЗначениеЗаполнено(ИсточникДата),ИсточникДата,"Дата");
		//Если ЭтоТабЧасть Тогда
		//	ПутьРеквизитаДата = "Ссылка." + ПутьРеквизитаДата;
		//КонецЕсли;
		ТекстЗапросаКонструктора = СтрЗаменить(ТекстЗапросаКонструктора, "<Период>", ПутьРеквизитаДата); 
		Условие1 = "Источник323." + ПутьРеквизитаДата + " Между &ДатаНачала И &ДатаКонца";
		
		Для каждого с из тзНаборПараметров Цикл
			Если ПустаяСтрока(Условие2) Тогда
				Условие2 = ФормируемУсловие(с, Запрос);
			Иначе
				Условие2 = Условие2 + " И " + ФормируемУсловие(с, Запрос);
			КонецЕсли;
		КонецЦикла;	
		
	Иначе
		
		Для каждого с из тзНаборПараметров Цикл
			ЭтоИзмерение = (ЭтоИзмерениеРесурс(ИсточникДанных, Строка(с.ЛевоеЗначение)) = 1);
			Если ЭтоИзмерение Тогда   
				Если ПустаяСтрока(Условие1) Тогда
					Условие1 = ФормируемУсловие(с, Запрос);
				Иначе
					Условие1 = Условие1 + " И " + ФормируемУсловие(с, Запрос);
				КонецЕсли;	
			Иначе 
				Если ПустаяСтрока(Условие2) Тогда
					Условие2 = ФормируемУсловие(с, Запрос);
				Иначе
					Условие2 = Условие2 + " И " + ФормируемУсловие(с, Запрос);
				КонецЕсли;
			КонецЕсли;	
		КонецЦикла;
		
		//
		Если НомерШаблона <> 1 И ЗначениеЗаполнено(ИсточникДата) Тогда 
			ПутьРеквизитаДата = ИсточникДата;
			//Путь к периоду сложный, перенесем условия по дате из виртуальной таблицы в условия
			ВиртПарамДатаНачала = "";
			ВиртПарамДатаКонца = "";
			Если ПустаяСтрока(Условие2) Тогда
				Условие2 = 					  "Источник323." + ПутьРеквизитаДата + " Между &ДатаНачала И &ДатаКонца";
			Иначе
				Условие2 = Условие2 + " И " + "Источник323." + ПутьРеквизитаДата + " Между &ДатаНачала И &ДатаКонца";
			КонецЕсли;
		Иначе
			ПутьРеквизитаДата = "Период";
			ВиртПарамДатаНачала = "&ДатаНачала";
			ВиртПарамДатаКонца = "&ДатаКонца";
		КонецЕсли;
		ТекстЗапросаКонструктора = СтрЗаменить(ТекстЗапросаКонструктора, "<Период>", ПутьРеквизитаДата);
		ТекстЗапросаКонструктора = СтрЗаменить(ТекстЗапросаКонструктора, "<&ДатаНачала>", ВиртПарамДатаНачала);
		ТекстЗапросаКонструктора = СтрЗаменить(ТекстЗапросаКонструктора, "<&ДатаКонца>", ВиртПарамДатаКонца);	
		//
		
	КонецЕсли;
		
	Если ЗначениеЗаполнено(ИсточникКонтрагент) Тогда
		ТекстЗапросаКонструктора = СтрЗаменить(ТекстЗапросаКонструктора, "<Контрагент>", ИсточникКонтрагент);
	Иначе
		ТекстЗапросаКонструктора = СтрЗаменить(ТекстЗапросаКонструктора, "Источник323.<Контрагент>", "НЕОПРЕДЕЛЕНО");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ИсточникСтатья) Тогда
		ТекстЗапросаКонструктора = СтрЗаменить(ТекстЗапросаКонструктора, "<Статья>", ИсточникСтатья);
	Иначе
	    ТекстЗапросаКонструктора = СтрЗаменить(ТекстЗапросаКонструктора, "Источник323.<Статья>", "НЕОПРЕДЕЛЕНО");
	КонецЕсли;	
		
	ТекстЗапросаКонструктора = СтрЗаменить(ТекстЗапросаКонструктора, "<Сумма>", ИсточникСумма);
	ТекстЗапросаКонструктора = СтрЗаменить(ТекстЗапросаКонструктора, "<ИсточникДанных>", ИсточникДанных);
		
	Если Не ПустаяСтрока(Условие1) Тогда
		ТекстЗапросаКонструктора = СтрЗаменить(ТекстЗапросаКонструктора, "1 = 1", Условие1);
	КонецЕсли;
	Если Не ПустаяСтрока(Условие2) Тогда
		ТекстЗапросаКонструктора = СтрЗаменить(ТекстЗапросаКонструктора, "2 = 2", Условие2);
	КонецЕсли;
	
	Запрос.Текст = ТекстЗапросаКонструктора;
	
	Возврат Запрос;

КонецФункции // ПолучитьЗапрос()

Функция ФормируемУсловие(стр, Запрос)
	ИмяПараметра = стр.ИмяПараметра;
	ЛевоеЗначение = стр.ЛевоеЗначение;
	ПравоеЗначение = стр.ПравоеЗначение;
	ВидСравненияЗн = стр.ВидСравнения;	
	Условие = "";
	
	Если ВидСравнения <> ВидСравненияКомпоновкиДанных.НеЗаполнено 
		И ВидСравнения <> ВидСравненияКомпоновкиДанных.Заполнено Тогда
		Условие = Строка(ЛевоеЗначение) + ТаблицаСоответствийВидовСравнений.Получить(ВидСравненияЗн);
		Условие = СтрЗаменить(Условие, "<ИмяПараметра>", ИмяПараметра);
		Запрос.УстановитьПараметр(ИмяПараметра, ПравоеЗначение);
	Иначе
		Условие = Строка(ЛевоеЗначение) + ТаблицаСоответствийВидовСравнений.Получить(ВидСравненияЗн);
	КонецЕсли;
	
	Возврат Условие;
	
КонецФункции

Функция ПолучитьНастройкиXML()
	
	//Если Не ЗначениеЗаполнено(ИсточникНастройкаОтбора) Тогда
	//	Возврат Неопределено;
	//КонецЕсли;
	//
	//Чтение = Новый ЧтениеXML;
	//НовыйСXDTO = Новый СериализаторXDTO(ФабрикаXDTO);
	//Путь = ПолучитьИмяВременногоФайла("xml");
	//ЗТ = Новый ЗаписьТекста(Путь);
	//ЗТ.ЗаписатьСтроку(ИсточникНастройкаОтбора);    
	//ЗТ.Закрыть();
	//Чтение.ОткрытьФайл(Путь);
	//Настройки = НовыйСXDTO.ПрочитатьXML(Чтение);   
	//
	//Возврат Настройки;
	
	Настройки = ИА_НастройкаОтбораХранилище.Получить();
	Возврат Настройки;
	
КонецФункции

// Возвращает:
// 1 - Измерение
// 2 - Ресурс, Реквизит
Функция ЭтоИзмерениеРесурс(ИмяОбъектаМетаданных, ИмяРеквизита)
	
	Если Не Найти(ИмяОбъектаМетаданных, "Документ.") = 0 Тогда
		Возврат 2;
	ИначеЕсли Не Найти(ИмяОбъектаМетаданных, "Регистр") = 0 Тогда
		ИмяРегистра = ПреобразоватьИмяРегистра(ИмяОбъектаМетаданных);
		ИмяРеквизита = ПреобразоватьИмяРесурса(ИмяОбъектаМетаданных, ИмяРеквизита);
		ЭтоРегистрБухгалтерии = Найти(ИмяРегистра, "РегистрБухгалтерии.") <> 0;
		Если ЭтоРегистрБухгалтерии Тогда
			ПолеИзмерения = Метаданные.НайтиПоПолномуИмени(ИмяРегистра).Ресурсы.Найти(ИмяРеквизита);
			Если ПолеИзмерения = Неопределено Тогда
				Возврат 1;
			Иначе
				Возврат 2;
			КонецЕсли;
		Иначе
			ПолеИзмерения = Метаданные.НайтиПоПолномуИмени(ИмяРегистра).Измерения.Найти(ИмяРеквизита);
			Если ПолеИзмерения = Неопределено Тогда
				Возврат 2;
			Иначе
				Возврат 1;
			КонецЕсли;	
		КонецЕсли;
	КонецЕсли;    
	
	Возврат 2;

КонецФункции 

Функция ПреобразоватьИмяРегистра(Знач ИмяРегистра) Экспорт
	ИмяРегистра = СтрЗаменить(ИмяРегистра, ".ОстаткиИОбороты", "");
	ИмяРегистра = СтрЗаменить(ИмяРегистра, ".Обороты", "");
	ИмяРегистра = СтрЗаменить(ИмяРегистра, ".Остатки", "");
	ИмяРегистра = СтрЗаменить(ИмяРегистра, ".СрезПервых", "");
	ИмяРегистра = СтрЗаменить(ИмяРегистра, ".СрезПоследних", "");
	ИмяРегистра = СтрЗаменить(ИмяРегистра, ".ДвиженияССубконто", "");
	                                         
	Возврат ИмяРегистра;

КонецФункции // ПреобразоватьИмяРегистра()

Функция ПреобразоватьИмяРесурса(ИмяРегистра, Знач ИмяРесурса) Экспорт
	ДлинаИмяРесурса = СтрДлина(ИмяРесурса);
	
	Если Найти(ИмяРегистра, ".ОстаткиИОбороты") > 0 Тогда
		
		КонечныйОстаток = "КонечныйОстаток";	ДлинаКонОст = СтрДлина(КонечныйОстаток);
		НачальныйОстаток = "НачальныйОстаток";  ДлинаНачОст = СтрДлина(НачальныйОстаток);
		Оборот = "Оборот";						ДлинаОборот = СтрДлина(Оборот);
		Приход = "Приход";						ДлинаПриход = СтрДлина(Приход);
		Расход = "Расход";						ДлинаРасход = СтрДлина(Расход);
		Если Прав(ИмяРесурса, ДлинаКонОст) = КонечныйОстаток Тогда
			ИмяРесурса = Лев(ИмяРесурса, ДлинаИмяРесурса - ДлинаКонОст);
		ИначеЕсли Прав(ИмяРесурса, ДлинаНачОст) = НачальныйОстаток Тогда
			ИмяРесурса = Лев(ИмяРесурса, ДлинаИмяРесурса - ДлинаНачОст);
		ИначеЕсли Прав(ИмяРесурса, ДлинаОборот) = Оборот Тогда
			ИмяРесурса = Лев(ИмяРесурса, ДлинаИмяРесурса - ДлинаОборот);
		ИначеЕсли Прав(ИмяРесурса, ДлинаПриход) = Приход Тогда
			ИмяРесурса = Лев(ИмяРесурса, ДлинаИмяРесурса - ДлинаПриход);
		ИначеЕсли Прав(ИмяРесурса, ДлинаРасход) = Расход Тогда
			ИмяРесурса = Лев(ИмяРесурса, ДлинаИмяРесурса - ДлинаРасход);
		КонецЕсли;	
		
	ИначеЕсли Найти(ИмяРегистра, ".Остатки") > 0 Тогда
		
		Остаток = "Остаток"; 	ДлинаОстаток = СтрДлина(Остаток);
		Если Прав(ИмяРесурса, ДлинаОстаток) = Остаток Тогда
			ИмяРесурса = Лев(ИмяРесурса, ДлинаИмяРесурса - ДлинаОстаток);
		КонецЕсли;
		
	ИначеЕсли Найти(ИмяРегистра, ".Обороты") > 0 Тогда
		
		Оборот = "Оборот";		ДлинаОборот = СтрДлина(Оборот);
		Приход = "Приход";		ДлинаПриход = СтрДлина(Приход);
		Расход = "Расход";		ДлинаРасход = СтрДлина(Расход);
		Если Прав(ИмяРесурса, ДлинаОборот) = Оборот Тогда
			ИмяРесурса = Лев(ИмяРесурса, ДлинаИмяРесурса - ДлинаОборот);
		ИначеЕсли Прав(ИмяРесурса, ДлинаПриход) = Приход Тогда
			ИмяРесурса = Лев(ИмяРесурса, ДлинаИмяРесурса - ДлинаПриход);
		ИначеЕсли Прав(ИмяРесурса, ДлинаРасход) = Расход Тогда
			ИмяРесурса = Лев(ИмяРесурса, ДлинаИмяРесурса - ДлинаРасход);
		КонецЕсли;
		
	КонецЕсли;

	Возврат ИмяРесурса;  	

КонецФункции // ПреобразоватьИмяРесурса()

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	 УдалитьЛишниеПараметры();
	Запрос = ПолучитьЗапросКонструктора();
	тзПараметры = Новый ТаблицаЗначений;
	тзПараметры.Колонки.Добавить("ИмяПараметра");
	тзПараметры.Колонки.Добавить("Значение");
	Для каждого Параметр из Запрос.Параметры Цикл
		стр = тзПараметры.Добавить();
		стр.ИмяПараметра = Параметр.Ключ;
		стр.Значение = Параметр.Значение;
	КонецЦикла;
	
	ИсточникХранилищеЗапросаКонстурктора = Новый ХранилищеЗначения(Новый Структура("Текст, Параметры", Запрос.Текст, тзПараметры));

КонецПроцедуры

Процедура УдалитьЛишниеПараметры()
	ВремТаб = ПараметрыВыраженияЗапроса.ВыгрузитьКолонки();
	
	Для каждого Стр из Доходы Цикл
		Отбор = Новый Структура();
		Отбор.Вставить("ВидДохода",Стр.ВидДохода);
		Отбор.Вставить("ВидПолученияДанных",Стр.ВидПолученияДанных);
		Строки = ПараметрыВыраженияЗапроса.НайтиСтроки(Отбор);
		Для Каждого Эл Из Строки Цикл
			Новстр = ВремТаб.Добавить();
			ЗаполнитьЗначенияСвойств(Новстр,Эл);
		КонецЦикла;
	КонецЦикла;
	ПараметрыВыраженияЗапроса.Загрузить(ВремТаб);
	
КонецПроцедуры

ТаблицаСоответствийВидовСравнений = Новый Соответствие;
ТаблицаСоответствийВидовСравнений.Вставить(ВидСравненияКомпоновкиДанных.Равно,	 			" = &<ИмяПараметра> ");
ТаблицаСоответствийВидовСравнений.Вставить(ВидСравненияКомпоновкиДанных.Больше, 			" > &<ИмяПараметра> ");
ТаблицаСоответствийВидовСравнений.Вставить(ВидСравненияКомпоновкиДанных.БольшеИлиРавно, 	" >= &<ИмяПараметра> ");
ТаблицаСоответствийВидовСравнений.Вставить(ВидСравненияКомпоновкиДанных.Меньше, 			" < &<ИмяПараметра> ");
ТаблицаСоответствийВидовСравнений.Вставить(ВидСравненияКомпоновкиДанных.МеньшеИлиРавно, 	" <= &<ИмяПараметра> ");
ТаблицаСоответствийВидовСравнений.Вставить(ВидСравненияКомпоновкиДанных.НеРавно, 			" <> &<ИмяПараметра> ");
ТаблицаСоответствийВидовСравнений.Вставить(ВидСравненияКомпоновкиДанных.ВИерархии, 			" В Иерархии(&<ИмяПараметра>) ");
ТаблицаСоответствийВидовСравнений.Вставить(ВидСравненияКомпоновкиДанных.ВСпискеПоИерархии, 	" В Иерархии(&<ИмяПараметра>) ");
ТаблицаСоответствийВидовСравнений.Вставить(ВидСравненияКомпоновкиДанных.ВСписке, 			" В(&<ИмяПараметра>) ");
ТаблицаСоответствийВидовСравнений.Вставить(ВидСравненияКомпоновкиДанных.НеВСписке, 			" Не В(&<ИмяПараметра>) ");
ТаблицаСоответствийВидовСравнений.Вставить(ВидСравненияКомпоновкиДанных.НеВИерархии, 		" Не В Иерархии(&<ИмяПараметра>) ");
ТаблицаСоответствийВидовСравнений.Вставить(ВидСравненияКомпоновкиДанных.НеВСпискеПоИерархии," Не В Иерархии(&<ИмяПараметра>) ");
ТаблицаСоответствийВидовСравнений.Вставить(ВидСравненияКомпоновкиДанных.Подобно, 			" Подобно &<ИмяПараметра> ");
ТаблицаСоответствийВидовСравнений.Вставить(ВидСравненияКомпоновкиДанных.НеПодобно, 			" Не Подобно &<ИмяПараметра> ");
//ТаблицаСоответствийВидовСравнений.Вставить(ВидСравненияКомпоновкиДанных.Заполнено, 		" <> Значение(<ТипОбъектаМетаданных>.<ИмяОбъектаМетаданных>.ПустаяСсылка) ");   
//ТаблицаСоответствийВидовСравнений.Вставить(ВидСравненияКомпоновкиДанных.НеЗаполнено, 		" = Значение(<ТипОбъектаМетаданных>.<ИмяОбъектаМетаданных>.ПустаяСсылка) ");
ТаблицаСоответствийВидовСравнений.Вставить(ВидСравненияКомпоновкиДанных.Заполнено, 			" <> Неопределено "); 
ТаблицаСоответствийВидовСравнений.Вставить(ВидСравненияКомпоновкиДанных.НеЗаполнено, 		" = Неопределено ");   
ТаблицаСоответствийВидовСравнений.Вставить(ВидСравненияКомпоновкиДанных.НачинаетсяС, 		" Подобно &<ИмяПараметра> ");   //?
ТаблицаСоответствийВидовСравнений.Вставить(ВидСравненияКомпоновкиДанных.НеНачинаетсяС, 		" Не Подобно &<ИмяПараметра> ");   //?
ТаблицаСоответствийВидовСравнений.Вставить(ВидСравненияКомпоновкиДанных.Содержит, 			" Подобно &<ИмяПараметра> ");   //?
ТаблицаСоответствийВидовСравнений.Вставить(ВидСравненияКомпоновкиДанных.НеСодержит, 		" Не Подобно &<ИмяПараметра> ");   //?
